//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其他用途
//单片机交流群：439190573
//淘宝店：https://futureworldrobot.taobao.com
//修改日期：2023/6/5
//版本：V5
//版权所有，盗版必究。
//未来世界机器人系列
//////////////////////////////////////////////////////////////////////////////////
#include "delay.h"

__IO u32 TimingDelay = 0;

/*********************************************************************
 *  函数名称：void Delay_Init
 *  函数功能：滴答定时器初始化
 *  形    参：无
 *  输    出：无
 *  备    注：无
 ********************************************************************/
void Delay_Init(void)
{
	if(SysTick_Config(SystemCoreClock / 1000000))	//ST3.5.0库版本		
	{
		while(1);
	}

	//初始化系统时钟成功后，关闭
	SysTick->CTRL &= ~ SysTick_CTRL_ENABLE_Msk;
}

/*********************************************************************
 *  函数名称：void Delay_us
 *  函数功能：延时us
 *  形    参：nTime：需要延时的 us 的数量
 *  输    出：无
 *  备    注：无
 ********************************************************************/
void Delay_us(__IO uint32_t nTime)
{
	TimingDelay = nTime;
	
	//使能滴答定时器
	SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
	
	while(TimingDelay != 0);	
}

/*********************************************************************
 *  函数名称：void Delay_ms
 *  函数功能：延时ms
 *  形    参：nTime：需要延时的 ms 的数量
 *  输    出：无
 *  备    注：无
 ********************************************************************/
void Delay_ms(__IO uint32_t nTime)
{
	TimingDelay = nTime * 1000;
	
	//使能滴答定时器
	SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
	
	while(TimingDelay != 0);	
}

/*********************************************************************
 *  函数名称：void TimeingDelay_Decrement
 *  函数功能：延时倒计时
 *  形    参：无
 *  输    出：无
 *  备    注：无
 ********************************************************************/
static void TimeingDelay_Decrement(void)
{
	if(TimingDelay != 0x00)
	{
		TimingDelay--;
	}
}

/*********************************************************************
 *  函数名称：void SysTick_Handler
 *  函数功能：系统中断函数
 *  形    参：无
 *  输    出：无
 *  备    注：无
 ********************************************************************/
void SysTick_Handler(void)  
{  
	TimeingDelay_Decrement();
}  





